/* TOOO: 
1. улучшить статические данные
2. улучшить читабельность этих данных (пустые пробелы)
*/

export const constants = {
  greeting: `
    Привет, я бот Synthia.
Здесь можешь прочитать наши правила
  `,
  rules1: `1. Право проведения первого заезда Музыкального марафона, перезапуска (далее - Марафон) остается за организатором акции. Ведущий следующей недели определяется через сайт randstuff.ru генератором случайных чисел организатором акции в конце каждого заезда в заранее оговоренное время во избежание фальсификаций и предоставляет видеоотчет участникам Марафона. Закрепленный за участником номер соответствует месту, занятому участником в рамках Марафона. 

2. Ведущий Марафона получает право определить тему следующего заезда Марафона, назначается ответственным за сбор, отправку аудиоконтента в общую беседу "Музыкальный марафон", а также подведение итогов и объявление результатов Марафона.
В случае отказа от проведения Марафона случайным образом выбирается следующий ведущий и т. д.

3. Участники марафона имеют право: 

3.1 Предлагать свои идеи тем на рассмотрение победителю Марафона;

3.2 Присылать любимые треки/треки из своего плейлиста/понравившиеся треки победителю Марафона; 

3.3 Голосовать за понравившиеся треки плейлиста при помощи реакций: 

3.3.1 при участии до 10 человек включительно распределение первых трех мест (🔥 - 1 место = 3 балла, ❤️ - 2 место = 2 балла, 👍- 3 место = 1 балл); 

3.3.2 при участии от 11 до 17 человек включительно - распределение первых пяти мест (🔥 - 1 место = 5 баллов, ❤️ - 2 место = 4 балла, 👍 - 3 место = 3 балла, 🥰 - 4 место = 2 балла, 🤩- 5 место = 1 балл); 

3.3.3 при участии от 18 человек и более - распределение первых шести мест (🔥 - 1 место = 6 баллов, ❤️ - 2 место = 5 баллов, 👍 - 3 место = 4 балла, 🥰 - 4 место = 3 балла, 🤩 - 5 место = 2 балла, ⚡️ - 6 место = 1 балл)

3.4 Сообщать ведущему в случае некорректного подсчета голосов;

3.5 Вносить конструктивные предложения в целях улучшения качества проведения Марафона. 

4. Ведущему строго запрещено разглашать отправителей треков голосующим до объявления результатов. 

`,
  rules2: `
5. Участникам строго запрещено:

5.1 разглашать свои треки остальным участникам до объявления результатов; 

5.2 голосовать по личностным соображениям: при обнаружении распределения баллов одним участником трекам одних и тех же участников несколько раз подряд, намеренного голосования за треки друг друга, либо позднюю перестановку голосов по личностным соображениям - дисквалификация на следующие три заезда, а также вычет двух побед (при наличии) из общего рейтинга. 

6. Сроки проведения одного заезда Марафона - одна неделя. Сроки назначения темы: с 00.00 понедельника до 00.00 часов вторника. В случае неназначения темы в указанные сроки, утром на следующий день случайным образом выбирается новый победитель, которому также дается срок до конца дня (00.00 часов) и т. д. Сроки сбора треков для плейлиста: с понедельника по четверг одной текущей недели (до 00.00 часов пятницы). Сроки отправки плейлиста - утро пятницы текущей недели (до 12.00), сроки проведения голосования за треки - до 18.00 воскресенья текущей недели.

7. Общий рейтинг - статистика, ведущаяся организатором акции и включающая в себя различные номинации, а также таблицу-карту совпадения музыкальных предпочтений участников. 

Статистика включает в себя следующие разделы:

1) Количество побед каждого участника за текущий год Марафона (Перезапуска); 
2) Количество попаданий в тройку лидеров каждого участника за текущий год Марафона (Перезапуска); 
3) Номинация "Лидер антирейтинга" (участник, чьи треки чаще других попадали в топ-3 антирейтинга (в число последних трех мест); 
4) Номинация "Самый огненный участник" (участник, чьи треки собрали наибольшее количество реакций в виде "🔥" (по 5 баллов) за текущий год Марафона (Перезапуска); 
5) Номинация "Почти огнь" (участник, чьи треки собрали наибольшее количество реакций в виде "❤️" (по 4 балла) за текущий год Марафона (Перезапуска); 
6) Номинация "Тоже хорош" (участник, чьи треки собрали наибольшее количество реакций в виде "👍" за текущий год Марафона (Перезапуска);
7) Номинация "Самый огненный трек" (трек, собравший наибольшее количество реакций в виде огней (5 баллов)
8) Номинация "Слушательская симпатия" (трек, собравший наибольшее общее количество реакций)
9) Статистика приоритетов - таблица, показывающая предпочтения участников (расстановку первых мест) в рамках Марафона в течение текущего года; 
10) Статистика предпочтений - таблица, показывающая предпочтения участников (по общему количеству отданных баллов за каждого отдельного участника) в рамках Марафона в течение текущего года.`,
  commonError: `
   Извини, я тебя не понимаю или возникла ошибка 
В любом случае напиши [@Emil313](@Emil313)
  `
}
